#include <iostream>
#include "module.h"

using namespace std;




int main(){

    vvod();
    cat();

}
// test 1: 
// Введите а: 12
// Введите b: 3
// Введите c: 24
// Введите d: 3
// Введите e: 5
// Введите f: 7
// -20/7
// Сокращённая дробь: -20/7

// test 2:
// Введите а: 12
// Введите b: 5
// Введите c: 3
// Введите d: 5
// Введите e: 4
// Введите f: 7
// 180/175
// Сокращённая дробь: 36/35

//test 3:
// Введите а: 2
// Введите b: 6
// Введите c: 4
// Введите d: 8
// Введите e: 12
// Введите f: 3
// -12/18
// Сокращённая дробь: -2/3

//test 4:
// Введите а: 43
// Введите b: 12
// Введите c: 12
// Введите d: 4
// Введите e: 3
// Введите f: 5
// 21/60
// Сокращённая дробь: 7/20
